{
  "base_model_name_or_path": "Qwen/Qwen2.5-7B-Instruct",
  "peft_type": "LORA",
  "task_type": "CAUSAL_LM",
  "r": 16,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj",
    "gate_proj",
    "up_proj",
    "down_proj"
  ],
  "bias": "none",
  "inference_mode": true,
  "modules_to_save": null,
  "fan_in_fan_out": false
}
