{
  "model_type": "qwen2",
  "tokenizer_class": "Qwen2Tokenizer",
  "chat_template": "{% for message in messages %}{% if loop.first and messages[0]['role'] != 'system' %}<|im_start|>system\nYou are a helpful assistant.<|im_end|>\n{% endif %}<|im_start|>{{ message['role'] }}\n{{ message['content'] }}<|im_end|>\n{% endfor %}{% if add_generation_prompt %}<|im_start|>assistant\n{% endif %}",
  "bos_token": "<|endoftext|>",
  "eos_token": "<|im_end|>",
  "pad_token": "<|endoftext|>",
  "vocab_size": 151936,
  "model_max_length": 2048,
  "added_tokens_decoder": {}
}
